avr-rust/avrd/packs/xmegad/ATxmega384D3.atdf
          <instance name="PORTC">
            <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
            <signals>
              <signal function="PORTC" group="P" index="0" pad="PC0"/>
              <signal function="PORTC" group="P" index="1" pad="PC1"/>
              <signal function="PORTC" group="P" index="2" pad="PC2"/>
              <signal function="PORTC" group="P" index="3" pad="PC3"/>
              <signal function="PORTC" group="P" index="4" pad="PC4"/>
              <signal function="PORTC" group="P" index="5" pad="PC5"/>
              <signal function="PORTC" group="P" index="6" pad="PC6"/>
              <signal function="PORTC" group="P" index="7" pad="PC7"/>
            </signals>
          </instance>
          <instance name="PORTD">
            <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
            <signals>
              <signal function="PORTD" group="P" index="0" pad="PD0"/>
              <signal function="PORTD" group="P" index="1" pad="PD1"/>
              <signal function="PORTD" group="P" index="2" pad="PD2"/>
              <signal function="PORTD" group="P" index="3" pad="PD3"/>
              <signal function="PORTD" group="P" index="4" pad="PD4"/>
              <signal function="PORTD" group="P" index="5" pad="PD5"/>
              <signal function="PORTD" group="P" index="6" pad="PD6"/>
              <signal function="PORTD" group="P" index="7" pad="PD7"/>
            </signals>
          </instance>
          <instance name="PORTE">
            <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
            <signals>
              <signal function="PORTE" group="P" index="0" pad="PE0"/>
              <signal function="PORTE" group="P" index="1" pad="PE1"/>
              <signal function="PORTE" group="P" index="2" pad="PE2"/>
              <signal function="PORTE" group="P" index="3" pad="PE3"/>
              <signal function="PORTE" group="P" index="4" pad="PE4"/>
              <signal function="PORTE" group="P" index="5" pad="PE5"/>
              <signal function="PORTE" group="P" index="6" pad="PE6"/>
              <signal function="PORTE" group="P" index="7" pad="PE7"/>
            </signals>
          </instance>
          <instance name="PORTF">
            <register-group address-space="data" offset="0x06A0" name-in-module="PORT" name="PORTF"/>
            <signals>
              <signal function="PORTF" group="P" index="0" pad="PF0"/>
              <signal function="PORTF" group="P" index="1" pad="PF1"/>
              <signal function="PORTF" group="P" index="2" pad="PF2"/>
              <signal function="PORTF" group="P" index="3" pad="PF3"/>
              <signal function="PORTF" group="P" index="4" pad="PF4"/>
              <signal function="PORTF" group="P" index="5" pad="PF5"/>
              <signal function="PORTF" group="P" index="6" pad="PF6"/>
              <signal function="PORTF" group="P" index="7" pad="PF7"/>
            </signals>
          </instance>
          <instance name="PORTR">
            <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
            <signals>
              <signal function="PORTR" group="P" index="0" pad="PR0"/>
              <signal function="PORTR" group="P" index="1" pad="PR1"/>
            </signals>
          </instance>
        </module>
        <module name="TC" id="I6090" version="XMEGAD">
          <instance name="TCC0">
            <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
            <signals>
              <signal field="TC0A" function="TC0" group="OC0A" pad="PC0"/>
              <signal field="TC0B" function="TC0" group="OC0B" pad="PC1"/>
              <signal field="TC0C" function="TC0" group="OC0C" pad="PC2"/>
              <signal field="TC0D" function="TC0" group="OC0D" pad="PC3"/>
              <signal field="TC0A" function="TC0_ALT" group="OC0A" pad="PC4"/>
              <signal field="TC0B" function="TC0_ALT" group="OC0B" pad="PC5"/>
              <signal field="TC0C" function="TC0_ALT" group="OC0C" pad="PC6"/>
              <signal field="TC0D" function="TC0_ALT" group="OC0D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCC1">
            <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
            <signals>
              <signal function="TC1" group="OC1A" pad="PC4"/>
              <signal function="TC1" group="OC1B" pad="PC5"/>
            </signals>
          </instance>
          <instance name="TCD0">
            <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PD0"/>
              <signal function="TC0" group="OC0B" pad="PD1"/>
              <signal function="TC0" group="OC0C" pad="PD2"/>
              <signal function="TC0" group="OC0D" pad="PD3"/>
            </signals>
          </instance>
          <instance name="TCE0">
            <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PE0"/>
              <signal function="TC0" group="OC0B" pad="PE1"/>
              <signal function="TC0" group="OC0C" pad="PE2"/>
              <signal function="TC0" group="OC0D" pad="PE3"/>
            </signals>
          </instance>
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PF0"/>
              <signal function="TC0" group="OC0B" pad="PF1"/>
              <signal function="TC0" group="OC0C" pad="PF2"/>
              <signal function="TC0" group="OC0D" pad="PF3"/>
            </signals>
          </instance>
        </module>
        <module name="TC2" id="I6090" version="XMEGAD">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PC0"/>
              <signal function="TC2" group="LOC2B" pad="PC1"/>
              <signal function="TC2" group="LOC2C" pad="PC2"/>
              <signal function="TC2" group="LOC2D" pad="PC3"/>
              <signal function="TC2" group="HOC2A" pad="PC4"/>
              <signal function="TC2" group="HOC2B" pad="PC5"/>
              <signal function="TC2" group="HOC2C" pad="PC6"/>
              <signal function="TC2" group="HOC2D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCD2">
            <register-group address-space="data" offset="0x900" name-in-module="TC2" name="TCD2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PD0"/>
              <signal function="TC2" group="LOC2B" pad="PD1"/>
              <signal function="TC2" group="LOC2C" pad="PD2"/>
              <signal function="TC2" group="LOC2D" pad="PD3"/>
              <signal function="TC2" group="HOC2A" pad="PD4"/>
              <signal function="TC2" group="HOC2B" pad="PD5"/>
              <signal function="TC2" group="HOC2C" pad="PD6"/>
              <signal function="TC2" group="HOC2D" pad="PD7"/>
            </signals>
          </instance>
