avr-rust/avrd/packs/xmegad/ATxmega384D3.atdf
        <register caption="Data Register 1" name="DATA1" offset="0x05" size="1"/>
        <register caption="Data Register 2" name="DATA2" offset="0x06" size="1"/>
        <register caption="Command" name="CMD" offset="0x0A" size="1">
          <bitfield caption="Command" mask="0x7F" name="CMD" values="NVM_CMD"/>
        </register>
        <register caption="Control Register A" name="CTRLA" offset="0x0B" size="1">
          <bitfield caption="Command Execute" mask="0x01" name="CMDEX"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x0C" size="1">
          <bitfield caption="EEPROM Mapping Enable" mask="0x08" name="EEMAPEN"/>
          <bitfield caption="Flash Power Reduction Enable" mask="0x04" name="FPRM"/>
          <bitfield caption="EEPROM Power Reduction Enable" mask="0x02" name="EPRM"/>
          <bitfield caption="SPM Lock" mask="0x01" name="SPMLOCK"/>
        </register>
        <register caption="Interrupt Control" name="INTCTRL" offset="0x0D" size="1">
          <bitfield caption="SPM Interrupt Level" mask="0x0C" name="SPMLVL" values="NVM_SPMLVL"/>
          <bitfield caption="EEPROM Interrupt Level" mask="0x03" name="EELVL" values="NVM_EELVL"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x0F" size="1">
          <bitfield caption="Non-volatile Memory Busy" mask="0x80" name="NVMBUSY"/>
          <bitfield caption="Flash Memory Busy" mask="0x40" name="FBUSY"/>
          <bitfield caption="EEPROM Page Buffer Active Loading" mask="0x02" name="EELOAD"/>
          <bitfield caption="Flash Page Buffer Active Loading" mask="0x01" name="FLOAD"/>
        </register>
        <register caption="Lock Bits" name="LOCKBITS" offset="0x10" size="1">
          <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="NVM_BLBB"/>
          <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="NVM_BLBA"/>
          <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="NVM_BLBAT"/>
          <bitfield caption="Lock Bits" mask="0x03" name="LB" values="NVM_LB"/>
        </register>
      </register-group>
      <value-group caption="NVM Command" name="NVM_CMD">
        <value caption="Noop/Ordinary LPM" name="NO_OPERATION" value="0x00"/>
        <value caption="Read user signature row" name="READ_USER_SIG_ROW" value="0x01"/>
        <value caption="Read calibration row" name="READ_CALIB_ROW" value="0x02"/>
        <value caption="Read EEPROM" name="READ_EEPROM" value="0x06"/>
        <value caption="Read fuse byte" name="READ_FUSES" value="0x07"/>
        <value caption="Write lock bits" name="WRITE_LOCK_BITS" value="0x08"/>
        <value caption="Erase user signature row" name="ERASE_USER_SIG_ROW" value="0x18"/>
        <value caption="Write user signature row" name="WRITE_USER_SIG_ROW" value="0x1A"/>
        <value caption="Erase Application Section" name="ERASE_APP" value="0x20"/>
        <value caption="Erase Application Section page" name="ERASE_APP_PAGE" value="0x22"/>
        <value caption="Load Flash page buffer" name="LOAD_FLASH_BUFFER" value="0x23"/>
        <value caption="Write Application Section page" name="WRITE_APP_PAGE" value="0x24"/>
        <value caption="Erase-and-write Application Section page" name="ERASE_WRITE_APP_PAGE" value="0x25"/>
        <value caption="Erase/flush Flash page buffer" name="ERASE_FLASH_BUFFER" value="0x26"/>
        <value caption="Erase Boot Section page" name="ERASE_BOOT_PAGE" value="0x2A"/>
        <value caption="Erase Flash Page" name="ERASE_FLASH_PAGE" value="0x2B"/>
        <value caption="Write Boot Section page" name="WRITE_BOOT_PAGE" value="0x2C"/>
        <value caption="Erase-and-write Boot Section page" name="ERASE_WRITE_BOOT_PAGE" value="0x2D"/>
        <value caption="Write Flash Page" name="WRITE_FLASH_PAGE" value="0x2E"/>
        <value caption="Erase-and-write Flash Page" name="ERASE_WRITE_FLASH_PAGE" value="0x2F"/>
        <value caption="Erase EEPROM" name="ERASE_EEPROM" value="0x30"/>
        <value caption="Erase EEPROM page" name="ERASE_EEPROM_PAGE" value="0x32"/>
        <value caption="Load EEPROM page buffer" name="LOAD_EEPROM_BUFFER" value="0x33"/>
        <value caption="Write EEPROM page" name="WRITE_EEPROM_PAGE" value="0x34"/>
        <value caption="Erase-and-write EEPROM page" name="ERASE_WRITE_EEPROM_PAGE" value="0x35"/>
        <value caption="Erase/flush EEPROM page buffer" name="ERASE_EEPROM_BUFFER" value="0x36"/>
        <value caption="Application section CRC" name="APP_CRC" value="0x38"/>
        <value caption=" Boot Section CRC" name="BOOT_CRC" value="0x39"/>
        <value caption="Flash Range CRC" name="FLASH_RANGE_CRC" value="0x3A"/>
        <value caption="Erase Chip" name="CHIP_ERASE" value="0x40"/>
        <value caption="Read NVM" name="READ_NVM" value="0x43"/>
        <value caption="Write Fuse byte" name="WRITE_FUSE" value="0x4C"/>
        <value caption="Erase Boot Section" name="ERASE_BOOT" value="0x68"/>
        <value caption="Flash CRC" name="FLASH_CRC" value="0x78"/>
      </value-group>
      <value-group caption="SPM ready interrupt level" name="NVM_SPMLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="EEPROM ready interrupt level" name="NVM_EELVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - boot setcion" name="NVM_BLBB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application section" name="NVM_BLBA">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Boot lock bits - application table section" name="NVM_BLBAT">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Read not allowed" name="RLOCK" value="0x01"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <value-group caption="Lock bits" name="NVM_LB">
        <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
        <value caption="Write not allowed" name="WLOCK" value="0x02"/>
        <value caption="No locks" name="NOLOCK" value="0x03"/>
      </value-group>
      <interrupt-group name="NVM">
        <interrupt index="0" name="EE" caption="EE Interrupt"/>
        <interrupt index="1" name="SPM" caption="SPM Interrupt"/>
      </interrupt-group>
    </module>
